# SetModeString

## Description
Sets the mode string to the given parameter

```pascal
PROCEDURE SetModeString(messageStr : STRING);
```

```python

def vs.SetModeString(messageStr):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|messageStr|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* Utility